course/set theory 1/homework/1/第一周作业.tex
% Created 2021-09-25 Sat 11:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[UTF8]{ctex}
\usepackage{amsthm}
\theoremstyle{definition}
\newtheorem{definition}{定义}
\newtheorem{proposition}{命题}
\newtheorem{exercise}{练习}
\author{陈淇奥\\21210160025}
\date{\today}
\title{第一周作业}
\hypersetup{
 pdfauthor={陈淇奥\\21210160025},
 pdftitle={第一周作业},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{exercise}[1.3.9]
证明：\((x,y)=(x',y')\)当且仅当\(x=x'\wedge y=y'\)
\end{exercise}

\begin{proof}
\begin{enumerate}
\item 若\((x,y)=(x',y')\)
\begin{enumerate}
\item 若\(x\neq y\)，则\(\{\{x\},\{x,y\}\}=\{\{x'\},\{x',y'\}\}\)，\(\{x\}\neq\{x,y\}\)，\(\{x'\}\neq\{x',y'\}\)。
因此\(\{x\}\in(x',y')\)且\(\{x,y\}\in(x',y')\)。因
为\((x',y')\)只有两个元素，于是\(\{x\}=\{x'\}\)或\(\{x\}=\{x',y'\}\)。若\(\{x\}=\{x',y'\}\)，则\(\{x,y\}=\{x'\}\)，
于是\(x\in\{x'\}\)且\(y\in\{x'\}\)，得到\(x=x'=y\)，与假设矛盾，因此\(\{x\} =\{x'\}\)，\(\{x,y\} =\{x',y'\}\)，因
此\(x=x',y=y'\)。
\item 若\(x=y\)，则\((x,y) =\{\{x\}\}\)只有一个元素，于是\(\{x'\} =\{x',y'\}\)，因此\(x'=y'\)且\(x=y\)。
\end{enumerate}
\item 若\(x=x'\wedge y=y'\)

于是\((x',y')=\{\{x'\},\{x',y'\}\}=\{\{x\},\{x,y\}\}\)，于是\(\forall x(x\in(x,y)\leftrightarrow x\in(x',y'))\)成立，因此\((x,y)=(x',y')\)
\end{enumerate}
\end{proof}

\begin{exercise}[1.3.17]
如果<是良序，则它也是线序
\end{exercise}

\begin{proof}
令<是\(X\)上的良序。对于任意\(x,y\in X\)且\(x\neq y\)，考虑集合\(\{x,y\}\)，它是\(X\)的子集，于是存
在\(x_0\in\{x,y\}\)使得对任意\(y\in\{x,y\}\)都有\(x_0=y\)或\(x_0<y\)。因为\(\{x,y\}\)只有两个元素，因
此\(x_0=x\)或\(x_0=y\)。若\(x_0=x\)，则\(x<y\)；若\(x_0=y\)，则\(y<x\)。因此<满足三歧性，因此它是线
序
\end{proof}

\begin{exercise}[1.3.22]
证明：对任意归纳集 \(X\)，\(\omega\subseteq X\)，因此无穷公理保证了它是一个集合，并且是最小的归纳集。
\end{exercise}

\begin{proof}
假设\(n\)是最小的满足\(n\in\omega\)，\(n\not\in X\)的后继序数，令\(n=S(m)\)，则\(m<n\)且\(m\in X\)。因为\(X\)是
归纳集，于是\(S(m)\in X\)，因此矛盾。因此对于任何\(n\in\omega\)，\(n\in X\)，所以\(\omega\subseteq X\)。
\end{proof}

\begin{exercise}[1.4.2]
令\(X\)和\(Y\)为任意集合，则\(X\)和\(Y\)的 \textbf{对称差} 定义为
\begin{equation*}
X\triangle Y=(X-Y)\cup(Y-X)
\end{equation*}
证明：
\begin{align*}
&X\cap(Y-Z)=(X\cap Y)-Z\\
&X-Y=\emptyset\text{ 当且仅当 }X\subseteq Y\\
&X\triangle X=\emptyset\\
&X\triangle Y=Y\Delta X\\
&(X\triangle Y)\triangle Z=X\triangle(Y\triangle Z)
\end{align*}
\end{exercise}

\begin{proof}
\begin{align*}
x\in X\cap(Y-Z)&\Leftrightarrow x\in X\wedge (x\in Y\wedge x\notin Z)\\
&\Leftrightarrow (x\in X\wedge x\in Y)\wedge x\notin Z\\
&\Leftrightarrow (x\in X\cap Y)\wedge x\notin Z\\
&\Leftrightarrow x\in (X\cap Y)-Z
\end{align*}
\begin{align*}
X-Y=\emptyset&\Leftrightarrow \neg\exists x(x\in X-Y)\\
&\Leftrightarrow \neg\exists x(x\in X\wedge x\notin Y)\\
&\Leftrightarrow \forall x(x\notin X\vee x\in Y)\\
&\Leftrightarrow \forall x(x\in X\to x\in Y)\\
&\Leftrightarrow X\subseteq Y
\end{align*}
\begin{align*}
x\in X\triangle X&\Leftrightarrow x\in(X-X)\cup(X-X)\\
&\Leftrightarrow x\in(X-X)\\
&\Leftrightarrow x\in X\wedge x\notin X\\
&\Leftrightarrow x\neq x\\
&\Leftrightarrow x\in\emptyset
\end{align*}
\begin{align*}
x\in X\triangle Y&\Leftrightarrow x\in (X-Y)\cup(Y-X)\\
&\Leftrightarrow x\in (X-Y)\vee x\in (Y-X)\\
&\Leftrightarrow x\in (Y-X)\vee x\in (X-Y)\\
&\Leftrightarrow x\in(Y-X)\cup(X-Y)\\
&\Leftrightarrow x\in Y\triangle X
\end{align*}
\begin{align*}
x\in(X\triangle Y)\triangle Z&\Leftrightarrow x\in((X\triangle Y)-Z)\cup(Z-(X\triangle Y))\\
&\Leftrightarrow (x\in ((X\triangle Y)-Z))\vee(x\in(Z-(X\triangle Y)))\\
&\Leftrightarrow (x\in X\triangle Y\wedge x\notin Z)\vee(x\in Z\wedge x\notin(X\triangle Y))\\
&\Leftrightarrow ((x\in (X-Y)\cup(Y-X))\wedge x\notin Z)\\&\quad\vee(x\in Z\wedge (x\notin X\vee x\in Y)\wedge(x\in X\vee x\notin Y))\\
&\Leftrightarrow (((x\in X\wedge x\notin Y)\vee(x\notin X\wedge x\in Y))\wedge x\notin Z)\\&\quad\vee
(x\in Z\wedge ((x\notin X\vee x\in Y)\wedge x\notin Y)\vee((x\notin X\vee x\in Y)\wedge x\in Y))\\
&\Leftrightarrow ((x\in X\wedge x\notin Y\wedge x\notin Z)\vee(x\notin X\wedge x\in Y\wedge x\notin Z))\\&\quad\vee(x\in Z\wedge x\notin X\wedge x\notin Y)\vee(x\in Z\wedge x\in X\wedge x\in Y)\\
&\Leftrightarrow (x\in X\wedge((x\notin Y\wedge x\notin Z)\vee(x\in Z\wedge x\in Y)))\\&\quad\vee(x\notin X\wedge((x\in Y\wedge x\notin Z)\vee(x\in Z\wedge x\notin Y)))\\
&\Leftrightarrow (x\in X\wedge x\notin Y\triangle Z)\vee(x\notin X\wedge x\in Y\triangle Z)\\
&\Leftrightarrow x\in X\triangle(Y\triangle Z)
\end{align*}
\end{proof}

\begin{exercise}[1.4.6]
如果\(X\)是集合，定义\(-X=\{x\mid x\notin X\}\)，证明\(-X\)不是集合
\end{exercise}

\begin{proof}
如果\(-X\)是集合，则\(-\emptyset=\{x\mid x\notin\emptyset\}\)是集合并且是所有集合的集合。但是所有集合的集合不是集合，因此矛盾，
于是\(-X\)不是集合
\end{proof}
\end{document}
